[
  "Did you hear about the guy whose whole left side was cut off? He's all right now.", 
  "I wasn't originally going to get a brain transplant, but then I changed my mind.",
  "Yesterday I accidentally swallowed some food coloring. The doctor says I'm OK, but I feel like I've dyed a little inside.",
  "Why don't some couples go to the gym? Because some relationships don't work out.",
  "I wondered why the baseball was getting bigger. Then it hit me.",
  "I'd tell you a chemistry joke but I know I wouldn't get a reaction.",
  "A friend of mine tried to annoy me with bird puns, but I soon realized that toucan play at that game.",
  "Have you ever tried to eat a clock? It's very time consuming.",
  "Did you hear about the guy who got hit in the head with a can of soda? He was lucky it was a soft drink.",
  "If there was someone selling drugs in this place, weed know.",
  "The experienced carpenter really nailed it, but the new guy screwed everything up.",
  "I used to be a banker but I lost interest.",
  "A man just assaulted me with milk, cream and butter. How dairy.",
  "When notes get in treble, bass-ically they get put behind bars. The alto-nate punishment is to push them off a clef and hope they land flat on sharp objects.",
  "I'm reading a book about anti-gravity. It's impossible to put down.",
  "A prisoner's favorite punctuation mark is the period. It marks the end of his sentence.",
  "I don't trust these stairs because they're always up to something.",
  "I relish the fact that you've mustard the strength to ketchup to me.",
  "I like European food so I decided to Russia over there because I was Hungary. After Czech'ing the menu I ordered Turkey. When I was Finnished I told the waiter 'Spain good but there is Norway I could eat another bite'.",
  "He drove his expensive car into a tree and found out how the Mercedes bends.",
  "The shoemaker did not deny his apprentice anything he needed. He gave his awl.",
  "When William joined the army he disliked the phrase 'fire at will'.",
  "Show me a piano falling down a mineshaft and I'll show you A-flat minor.",
  "Something about subtraction just doesn't add up.",
  "Is old rope good enough for a hanging? Frayed knot. That stuff is bad noose.",
  "So what if I don't know what apocalypse means!? It's not the end of the world!",
  "Why don't programmers like nature? It has too many bugs.",
  "Claustrophobic people are more productive thinking outside the box.",
  "I went to the dentist without lunch, and he gave me a plate.",
  "It's not that the man did not know how to juggle, he just didn't have the balls to do it.",
  "Atheists don't solve exponential equations because they don't believe in higher powers.",
  "I couldn't quite remember how to throw a boomerang, but eventually it came back to me.",
  "The one who invented the door knocker got a No-bell prize.",
  "Police were called to a daycare where a three-year-old was resisting a rest.",
  "I'm glad I know sign language, it's pretty handy.",
  "What did the grape say when it got stepped on? Nothing - but it let out a little whine.",
  "The other day I held the door open for a clown. I thought it was a nice jester.",
  "What is the difference between a nicely dressed man on a tricycle and a poorly dressed man on a bicycle? A tire.",
  "A small boy swallowed some coins and was taken to a hospital. When his grandmother telephoned to ask how he was a nurse said 'No change yet'.",
  "The roundest knight at king Arthur's round table was Sir Cumference.",
  "I don't know if I just got hit by freezing rain, but it hurt like hail.",
  "Never discuss infinity with a mathematician, they can go on about it forever.",
  "My friend's bakery burned down last night. Now his business is toast.",
  "A bicycle can't stand on its own because it is two-tired.",
  "It's a lengthy article on Japanese Sword Fighters but I can Samurais it for you.",
  "Smaller babies may be delivered by stork but the heavier ones need a crane.",
  "The man who survived mustard gas and pepper spray is now a seasoned veteran.",
  "Peter Pan is the worst boxer because when he punches they Neverland.",
  "I knew a woman who owned a taser, man was she stunning!",
  "Need an ark to save two of every animal? I noah guy.",
  "I used to have a fear of hurdles, but I got over it.",
  "What do dogs do after they finish obedience school? They get their masters.",
  "The first time I used an elevator it was really uplifting, then it let me down.",
  "I once got into so much debt that I couldn't even afford my electricity bills, they were the darkest times of my life.",
  "There was once a cross-eyed teacher who couldn't control his pupils.",
  "It was an emotional wedding. Even the cake was in tiers.",
  "My relationship with my chauffeur just isn't going anywhere. It feels like he's always trying to drive me away.",
  "To write with a broken pencil is pointless.",
  "My job at the concrete plant seems to get harder and harder.",
  "A new type of broom came out, it is sweeping the nation.",
  "The girl quit her job at the doughnut factory because she was fed up with the hole business.",
  "Taxidermy is a job for stuffy people.",
  "There was a sign on the lawn at a drug re-hab center that said 'Keep off the Grass'.",
  "I think Santa has riverfront property in Brazil. All our presents came from Amazon this year.",
  "The butcher backed up into the meat grinder and got a little behind in his work.",
  "I was going to buy a book on phobias, but I was afraid it wouldn't help me.",
  "The store keeps calling me to come back and buy more bedroom furniture, but all I really wanted was one night stand.",
  "I once heard a joke about amnesia, but I forgot how it goes.",
  "Did you know they won't be making yard sticks any longer?",
  "I did a theatrical performance about puns. Really it was just a play on words.",
  "I saw a beaver movie last night, it was the best dam movie I've ever seen.",
  "Atheism is a non-prophet organization.",
  "I really wanted a camouflage shirt, but I couldn't find one.",
  "Two hats were hanging on a hat rack in the hallway. One hat says to the other, 'You stay here, I'll go on a head.'.",
  "I was going to look for my missing watch, but I could never find the time.",
  "My friend was fired from his job at the road department for stealing. I have to say I saw it coming. The last time I was at his house all the signs were there.",
  "I knew a guy who collected candy canes, they were all in mint condition.",
  "My fear of roses is a thorny issue. I'm not sure what it stems from, but it seems likely I'll be stuck with it.",
  "The dead batteries were given out free of charge.",
  "The tale of the haunted refrigerator was chilling.",
  "I told my wife that it was her turn to shovel and salt the front steps. All I got was icy stares.",
  "Two peanuts were walking in a tough neighborhood and one of them was a-salted.",
  "When the cannibal showed up late to the luncheon, they gave him the cold shoulder.",
  "When the window fell into the incinerator, it was a pane in the ash to retrieve.",
  "What's the definition of a will? (It's a dead giveaway).",
  "Learning to sleep upside down is often hard for baby bats, but they soon get the hang of it.",
  "Eager for some bargains, she was itching to get to the flea market.",
  "Why did the pig stop sunbathing? He was bacon in the heat.",
  "I used to be addicted to soap, but I'm clean now.",
  "There is a special species of bird that is really good at holding stuff together. They are called velcrows.",
  "The patron saint of poverty is St. Nickeless.",
  "Always trust a glue salesman. They tend to stick to their word.",
  "If towels could tell jokes they would probably have a dry sense of humor.",
  "When a clock is hungry it goes back four seconds.",
  "Circling vultures are a dead giveaway.",
  "If you lose your hearing, is it ear replaceable?",
  "England doesn't have a kidney bank, but it does have a Liverpool",
  "Since I've quit soccer, I've lost my goal in life.",
  "Weight loss mantra? Fat chants!",
  "Novice pirates make terrible singers because they can't hit the high seas.",
  "My new theory on inertia doesn't seem to be gaining momentum.",
  "I don't get people who stumble into mirrors. They need to watch themselves.",
  "Einstein developed a theory about space, and it was about time too.",
  "Money launderers are filthy rich!",
  "Did you hear about the nun who procrastinated doing her laundry? She had a filthy habit.",
  "Alternative facts are aversion of the truth.",
  "I think I'm going to hire the same landscaper I used last year - he was really easy to get a lawn with.",
  "Did you hear about the crime that happened in a parking garage? It was wrong on so many levels.",
  "Jill broke her finger today, but on the other hand she was completely fine.",
  "Pencils could be made with erasers at both ends, but what would be the point?",
  "Some people's noses and feet are built backwards: their feet smell and their noses run.",
  "I would tell you a leech joke, but it would suck anyway.",
  "I should have been sad when my flashlight batteries died, but I was delighted.",
  "What did the man say when the bridge fell on him. The suspension is killing me.",
  "John Deere's manure spreader is the only equipment the company won't stand behind.",
  "A quarter-acre of undeveloped land may not seem like much to some people, but to me it's a lot.",
  "What do you call a bald monster? A lock-less monster.",
  "My tailor is happy to make a pair of pants for me, or at least sew it seams.",
  "Broken puppets for sale. No strings attached.",
  "Did you hear about these new reversible jackets? I'm excited to see how they turn out.",
  "I mixed up the cardiac resuscitation equipment with the lie detector, but I will de-fib you later.",
  "A hole has been found in the nudist camp wall. The police are looking into it.",
  "The leopard tried creeping up on the tigers using its camouflage but it was spotted.",
  "Whenever there is an earthquake the geologists are always quick to find fault.",
  "The magician got so mad he pulled his hare out.",
  "The meaning of opaque is unclear.",
  "Weight loss pills stolen this morning - police say suspects are still at large.",
  "What is a thesaurus' favorite dessert? Synonym buns.",
  "I don't mind kids playing hopscotch in most places, but my driveway is where I draw the line.",
  "Children who fail their coloring exams always need a shoulder to crayon.",
  "A relief map shows where the restrooms are.",
  "A hungry traveller stops at a monastery and is taken to the kitchens. A brother is frying chips. 'Are you the friar?' he asks. 'No. I'm the chip monk,' he replies.",
  "When a female sheep turns around and goes the other way it makes a ewe turn.",
  "I was going to tell you a joke about infinity, but it didn't have an ending!",
  "How do trains drink? They chug.",
  "You know prices are rising when you buy a winter jacket and even down is up.",
  "There was a big paddle sale at the boat store. It was quite an oar deal.",
  "Sleeping comes so naturally to me, I could do it with my eyes closed.",
  "Proper punctuation can make the difference between a sentence that's well-written and a sentence that's, well, written.",
  "I used to hate maths but then I realised decimals have a point.",
  "My student was late for class, claiming he was in the washroom. I think he was stalling.",
  "I was struggling to figure out how lightning works then it struck me.",
  "Where do you imprison a skeleton? In a rib cage.",
  "The Balloon family name died off when it ran out of heir.",
  "I wrote a novel about religious women. The library put it in the nun fiction section.",
  "I try wearing tight jeans, but I can never pull it off.",
  "Time flies like an arrow. Fruit flies like a banana.",
  "People are choosing cremation over traditional burial. It shows that they are thinking out of the box.",
  "My dog has a lot of potential, you just have to unleash it.",
  "Why did the capacitor kiss the diode? He just couldn't resistor."
]